		
		"Discriminator"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		conv2d_5 (Conv2D)            (None, 32, 32, 64)        1792      
		_________________________________________________________________
		leaky_re_lu_8 (LeakyReLU)    (None, 32, 32, 64)        0         
		_________________________________________________________________
		conv2d_6 (Conv2D)            (None, 16, 16, 128)       73856     
		_________________________________________________________________
		leaky_re_lu_9 (LeakyReLU)    (None, 16, 16, 128)       0         
		_________________________________________________________________
		conv2d_7 (Conv2D)            (None, 8, 8, 128)         147584    
		_________________________________________________________________
		leaky_re_lu_10 (LeakyReLU)   (None, 8, 8, 128)         0         
		_________________________________________________________________
		conv2d_8 (Conv2D)            (None, 4, 4, 256)         295168    
		_________________________________________________________________
		leaky_re_lu_11 (LeakyReLU)   (None, 4, 4, 256)         0         
		_________________________________________________________________
		flatten_1 (Flatten)          (None, 4096)              0         
		_________________________________________________________________
		dropout_1 (Dropout)          (None, 4096)              0         
		_________________________________________________________________
		dense_2 (Dense)              (None, 1)                 4097      
		=================================================================
		
Total params: 522,497
Trainable params: 522,497
Non-trainable params: 0



		
		"Genarator"
		_________________________________________________________________
		Layer (type)                 Output Shape              Param #   
		=================================================================
		dense_3 (Dense)              (None, 4096)              413696    
		_________________________________________________________________
		leaky_re_lu_12 (LeakyReLU)   (None, 4096)              0         
		_________________________________________________________________
		reshape_1 (Reshape)          (None, 4, 4, 256)         0         
		_________________________________________________________________
		conv2d_transpose_3 (Conv2DTr (None, 8, 8, 128)         524416    
		_________________________________________________________________
		leaky_re_lu_13 (LeakyReLU)   (None, 8, 8, 128)         0         
		_________________________________________________________________
		conv2d_transpose_4 (Conv2DTr (None, 16, 16, 128)       262272    
		_________________________________________________________________
		leaky_re_lu_14 (LeakyReLU)   (None, 16, 16, 128)       0         
		_________________________________________________________________
		conv2d_transpose_5 (Conv2DTr (None, 32, 32, 128)       262272    
		_________________________________________________________________
		leaky_re_lu_15 (LeakyReLU)   (None, 32, 32, 128)       0         
		_________________________________________________________________
		conv2d_9 (Conv2D)            (None, 32, 32, 3)         3459      
		=================================================================



Total params: 1,466,115
Trainable params: 1,466,115
Non-trainable params: 0
_________________________________________________________________
>1, 1/34, d1=0.693, d2=0.696 g=0.692
>1, 2/34, d1=0.592, d2=0.697 g=0.690
>1, 3/34, d1=0.504, d2=0.702 g=0.686
>1, 4/34, d1=0.402, d2=0.714 g=0.676